"""Дан прямоугольник со сторонами a см и b см, сколько квадратов со стороной 30 см можно отрезать от него.
a и b задаются в одной строке с клавиатуры.

Sample Input :

150 65

Sample Output :

Можно отрезать 10 квадратов."""


"""Дано трехзначное число. Найти число, полученное при прочтении его цифр справа налево."""

"""Дано число секунд.Вычислите сколько это часов, минут и секунд.
Sample
Input: 4000
Sample
Output: 1 часов 6 минут 40 секунд"""
a = int(input("Введите количество секунд: "))
b = a/60
c = b/60
d = c/60
print(a)
print(d,c,b)

